<img src="img/Peoplelogy-Logo.png" height=120 width=120 align=left>
<img src="img/sql.png" height=100 width=250 align=right>

# **Challenge: Who Stole the Duck from Fiftyville?**

---
<img src="img/12.jpg">

---
## **The famous duck statue has been stolen from Fiftyville!**

The town of Fiftyville has called upon you to solve the mystery of the stolen duck. Authorities believe that the thief stole the duck and then, shortly afterwards, took a flight out of town with the help of an accomplice. Your goal is to identify:

- **Who the thief is,**
- **What city the thief escaped to, and**
- **Who the thief’s accomplice is who helped them escape.**

#### All you know is that the theft took place on **July 28, 2023**, and that it occurred on **Humphrey Street**.

### **How Will You Solve the Mystery?**

The Fiftyville authorities have collected some of the town’s records from around the time of the theft and prepared a SQLite database for you, `fiftyville.db`, which contains tables of data from various sources around the town. You can query that database using **SQL SELECT** queries to access the data of interest to you.

Using just the information in the database, your task is to solve the mystery.


### **Available Tables**:


- **crime_scene_reports**: Contains information about crime scenes, including the date and street location of the crime.
    - Columns: `id`, `year`, `month`, `day`, `street`, `description`
  
- **interviews**: Contains transcripts of interviews conducted with suspects or witnesses.
    - Columns: `id`, `name`, `year`, `month`, `day`, `transcript`

- **atm_transactions**: Records of ATM transactions made by residents of Fiftyville.
    - Columns: `id`, `account_number`, `year`, `month`, `day`, `atm_location`, `transaction_type`, `amount`
  
- **bank_accounts**: Information about bank accounts, including the account holder (person).
    - Columns: `account_number`, `person_id`, `creation_year`
  
- **airports**: Information about airports, including their abbreviation, full name, and city.
    - Columns: `id`, `abbreviation`, `full_name`, `city`
  
- **flights**: Details about flights, including the origin and destination airports, and the time of departure.
    - Columns: `id`, `origin_airport_id`, `destination_airport_id`, `year`, `month`, `day`, `hour`, `minute`
  
- **passengers**: Information about flight passengers and their seat assignments.
    - Columns: `flight_id`, `passport_number`, `seat`
  
- **phone_calls**: Records of phone calls made between individuals in Fiftyville.
    - Columns: `id`, `caller`, `receiver`, `year`, `month`, `day`, `duration`
  
- **people**: Personal information about the residents of Fiftyville, including their license plate numbers and phone numbers.
    - Columns: `id`, `name`, `phone_number`, `passport_number`, `license_plate`
  
- **bakery_security_logs**: Logs from the bakery security system, capturing vehicle activity and license plates.
    - Columns: `id`, `year`, `month`, `day`, `hour`, `minute`, `activity`, `license_plate`

---



### **Instructions**:

Follow the clues hidden in the tables to find out **who stole the duck**. Use SQL queries to investigate and gather information.

1. **Investigate the Crime Scene**:
    - Query the `crime_scene_reports` table to find out when and where the theft took place.

---
2. **Interview Witnesses**:
    - Check the `interviews` table for any witness statements regarding the theft. Look for clues in the transcripts.
---

3. **Analyze ATM Transactions**:
    - Use the `atm_transactions` table to see if any suspicious financial activity occurred near the time of the theft.

---
4. **Investigate the Bakery's Security Logs**:
    - The thief may have passed by the bakery. Check the `bakery_security_logs` table for suspicious vehicles.


---
5. **Trace Flight Passengers**:
    - Query the `flights` and `passengers` tables to check if the thief attempted to flee town by plane. Cross-reference the suspect's passport number.

---
6. **Check Phone Records**:
    - Investigate phone records in the `phone_calls` table to see if any calls were made around the time of the theft.

---
7. **Identify the Culprit**:
    - Combine the clues from all the tables and cross-reference the `people` table to find out who stole the duck.

---

### **Bonus Challenge**:

For advanced detectives, try writing a single SQL query that **JOINs** multiple tables together to narrow down the suspect list. You can use the vehicle license plates, phone records, and flight data to identify the thief.

In [1]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from ipython-sql) (3.11.0)
Requirement already satisfied: ipython in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from ipython-sql) (8.28.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from ipython-sql) (2.0.36)
Requirement already satisfied: sqlparse in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from ipython-sql) (0.5.1)
Requirement already satisfied: six in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (3.1.1)
Requirement already satisfied: decorator in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: matplotlib-inline in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from ipython->ipython-sql) (3.0.48)
Requirement already satisfied: pygments>=2.4.0 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from ipython->ipython-sql) (2.18.0)
Requirement already satisfied: stack-data in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: colorama in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: wcwidth in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: executing>=1.2.0 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from stack-data->ipython->ipython-sql) (2.1.0)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from stack-data->ipython->ipython-sql) (2.4.1)
Requirement already satisfied: pure-eval in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.3)

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///fiftyville.db

### Crime Overview
The crime took place on **July 28**, and the incident occurred on **Humphrey St.**. The theft of the duck is believed to have happened in this location, which is a critical clue in solving the case.

In [4]:
%%sql
SELECT * FROM crime_scene_reports
WHERE month = 7
    AND day = 28
    AND street LIKE '%Humphrey%';

 * sqlite:///fiftyville.db
Done.

[(295, 2021, 7, 28, 'Humphrey Street', 'Theft of the CS50 duck took place at 10:15am at the Humphrey Street bakery. Interviews were conducted today with three witnesses who were present at the time – each of their interview transcripts mentions the bakery.'),
 (297, 2021, 7, 28, 'Humphrey Street', 'Littering took place at 16:36. No known witnesses.')]

### Crime Details
The theft occurred at **10:15 AM** on **July 28**, at **Humphrey St.**. All three witnesses have confirmed that they were present at the **Bakery**, making it a crucial location in the investigation. Their testimonies might provide important clues about the events leading to the crime.

In [5]:
%%sql
SELECT * FROM interviews
WHERE month = 7
    AND day = 28
    AND transcript LIKE '%bakery%';

 * sqlite:///fiftyville.db
Done.

[(161, 'Ruth', 2021, 7, 28, 'Sometime within ten minutes of the theft, I saw the thief get into a car in the bakery parking lot and drive away. If you have security footage from the bakery parking lot, you might want to look for cars that left the parking lot in that time frame.'),
 (162, 'Eugene', 2021, 7, 28, "I don't know the thief's name, but it was someone I recognized. Earlier this morning, before I arrived at Emma's bakery, I was walking by the ATM on Leggett Street and saw the thief there withdrawing some money."),
 (163, 'Raymond', 2021, 7, 28, 'As the thief was leaving the bakery, they called someone who talked to them for less than a minute. In the call, I heard the thief say that they were ... (9 characters truncated) ...  to take the earliest flight out of Fiftyville tomorrow. The thief then asked the person on the other end of the phone to purchase the flight ticket.')]

### Witness Testimonies at the Bakery

1. **Ruth**: 
   - Ruth reported seeing a car leaving the crime scene approximately **10 minutes** after the theft occurred. This detail suggests the thief may have fled in a vehicle, possibly heading towards a nearby location.

2. **Eugene**: 
   - Eugene witnessed the theft firsthand by the **ATM on Leggett St.**, where the thief was seen withdrawing some money. This connection to the ATM could be vital in linking the thief to the crime scene and establishing a timeline.

3. **Raymond**: 
   - Raymond overheard a conversation where the thief mentioned plans to **fly to Fiftyville** the **next day** (earliest). This conversation, which lasted less than **60 seconds**, could indicate the thief's intentions and possibly point to their next destination.

#### To identify any info from Eugene statement

In [6]:
%%sql
SELECT * FROM atm_transactions
WHERE month = 7
    AND day = 28
    AND atm_location LIKE '%Leggett%'
    AND transaction_type = 'withdraw';

 * sqlite:///fiftyville.db
Done.

[(246, 28500762, 2021, 7, 28, 'Leggett Street', 'withdraw', 48),
 (264, 28296815, 2021, 7, 28, 'Leggett Street', 'withdraw', 20),
 (266, 76054385, 2021, 7, 28, 'Leggett Street', 'withdraw', 60),
 (267, 49610011, 2021, 7, 28, 'Leggett Street', 'withdraw', 50),
 (269, 16153065, 2021, 7, 28, 'Leggett Street', 'withdraw', 80),
 (288, 25506511, 2021, 7, 28, 'Leggett Street', 'withdraw', 20),
 (313, 81061156, 2021, 7, 28, 'Leggett Street', 'withdraw', 30),
 (336, 26013199, 2021, 7, 28, 'Leggett Street', 'withdraw', 35)]

#### To identify the license_plate

In [7]:
%%sql
SELECT * FROM bakery_security_logs
WHERE month = 7
    AND day = 28
    AND hour = 10
    AND minute BETWEEN 15 AND 25
    AND activity ='exit';

 * sqlite:///fiftyville.db
Done.

[(260, 2021, 7, 28, 10, 16, 'exit', '5P2BI95'),
 (261, 2021, 7, 28, 10, 18, 'exit', '94KL13X'),
 (262, 2021, 7, 28, 10, 18, 'exit', '6P58WS2'),
 (263, 2021, 7, 28, 10, 19, 'exit', '4328GD8'),
 (264, 2021, 7, 28, 10, 20, 'exit', 'G412CB7'),
 (265, 2021, 7, 28, 10, 21, 'exit', 'L93JTIZ'),
 (266, 2021, 7, 28, 10, 23, 'exit', '322W7JE'),
 (267, 2021, 7, 28, 10, 23, 'exit', '0NTHK55')]

#### To identify the origin_airport_id which the thief fly from Fiftyville

In [8]:
%%sql
SELECT * FROM airports
WHERE city = 'Fiftyville'

 * sqlite:///fiftyville.db
Done.

[(8, 'CSF', 'Fiftyville Regional Airport', 'Fiftyville')]

#### To identify the flight info based on the Raymond description in which fly the first flight from Fiftyville

In [9]:
%%sql
SELECT * FROM flights
WHERE origin_airport_id = 8
    AND month = 7
    AND day = 29
    ORDER BY hour
    LIMIT 1;

 * sqlite:///fiftyville.db
Done.

[(36, 8, 4, 2021, 7, 29, 8, 20)]

### Thief's Escape Flight

- The thief boarded the **first flight** the next day at **08:20 AM**, with **flight_id = 36**.
- The flight's destination was **airport_id = 4**, which points to the thief's intended escape location.

#### To identify the location of the airport

In [10]:
%%sql
SELECT * FROM airports
WHERE id = 4

 * sqlite:///fiftyville.db
Done.

[(4, 'LGA', 'LaGuardia Airport', 'New York City')]

### Question 2: What city did the thief escape to?

- The thief escaped to **New York City**. This is the city associated with the destination airport (airport_id = 4), which was the thief's escape route.

In [11]:
%%sql
SELECT * FROM passengers
WHERE flight_id = 36

 * sqlite:///fiftyville.db
Done.

[(36, 7214083635, '2A'),
 (36, 1695452385, '3B'),
 (36, 5773159633, '4A'),
 (36, 1540955065, '5C'),
 (36, 8294398571, '6C'),
 (36, 1988161715, '6D'),
 (36, 9878712108, '7A'),
 (36, 8496433585, '7B')]

### Thief's Identity

- **One of the passport numbers** is linked to the thief. This piece of information could be crucial in identifying the thief among the suspects and confirming their identity.

#### To combine passengers & people table to get the name based on passport no

In [12]:
%%sql
SELECT people.name, passengers.passport_number, passengers.flight_id
FROM passengers
JOIN people ON passengers.passport_number = people.passport_number
WHERE passengers.flight_id = 36;

 * sqlite:///fiftyville.db
Done.

[('Doris', 7214083635, 36),
 ('Sofia', 1695452385, 36),
 ('Bruce', 5773159633, 36),
 ('Edward', 1540955065, 36),
 ('Kelsey', 8294398571, 36),
 ('Taylor', 1988161715, 36),
 ('Kenny', 9878712108, 36),
 ('Luca', 8496433585, 36)]

### Conclusion

- Based on the evidence and clues gathered, **the thief is one of the suspects mentioned above**. Further investigation into their actions, alibis, and connections to the crime scene will help confirm the identity of the thief.

#### To identify the caller/receiver based on Raymond description

In [13]:
%%sql
SELECT * FROM phone_calls
    WHERE month = 7
    AND day = 28
    AND duration < 60;

 * sqlite:///fiftyville.db
Done.

[(221, '(130) 555-0289', '(996) 555-8899', 2021, 7, 28, 51),
 (224, '(499) 555-9472', '(892) 555-8872', 2021, 7, 28, 36),
 (233, '(367) 555-5533', '(375) 555-8161', 2021, 7, 28, 45),
 (251, '(499) 555-9472', '(717) 555-1342', 2021, 7, 28, 50),
 (254, '(286) 555-6063', '(676) 555-6554', 2021, 7, 28, 43),
 (255, '(770) 555-1861', '(725) 555-3243', 2021, 7, 28, 49),
 (261, '(031) 555-6622', '(910) 555-3251', 2021, 7, 28, 38),
 (279, '(826) 555-1652', '(066) 555-9701', 2021, 7, 28, 55),
 (281, '(338) 555-6650', '(704) 555-2131', 2021, 7, 28, 54)]

#### To identify the list of the name and license_plate based on Ruth descrition

In [14]:
%%sql
SELECT people.name, bakery_security_logs.license_plate
FROM bakery_security_logs
JOIN people ON bakery_security_logs.license_plate = people.license_plate
WHERE month = 7
    AND day = 28
    AND hour = 10
    AND minute BETWEEN 15 AND 25
    AND activity ='exit';

 * sqlite:///fiftyville.db
Done.

[('Vanessa', '5P2BI95'),
 ('Bruce', '94KL13X'),
 ('Barry', '6P58WS2'),
 ('Luca', '4328GD8'),
 ('Sofia', 'G412CB7'),
 ('Iman', 'L93JTIZ'),
 ('Diana', '322W7JE'),
 ('Kelsey', '0NTHK55')]

#### To narrow down the suspect list based on passport_number and license_plate

In [15]:
%%sql
SELECT p1.name, p1.passport_number, p2.license_plate
FROM 
    (SELECT people.name, people.passport_number 
     FROM people 
     JOIN passengers ON people.passport_number = passengers.passport_number
     WHERE passengers.flight_id = 36) AS p1
JOIN 
    (SELECT people.name, bakery_security_logs.license_plate 
     FROM people 
     JOIN bakery_security_logs ON people.license_plate = bakery_security_logs.license_plate
     WHERE bakery_security_logs.month = 7
        AND bakery_security_logs.day = 28
        AND bakery_security_logs.hour = 10
        AND bakery_security_logs.minute BETWEEN 15 AND 25
        AND bakery_security_logs.activity = 'exit') AS p2
ON p1.name = p2.name;

 * sqlite:///fiftyville.db
Done.

[('Sofia', 1695452385, 'G412CB7'),
 ('Bruce', 5773159633, '94KL13X'),
 ('Kelsey', 8294398571, '0NTHK55'),
 ('Luca', 8496433585, '4328GD8')]

### Suspect List

- After analyzing the evidence, the suspect list has been narrowed down to **four people**:  
  - **Sofia**  
  - **Bruce**  
  - **Kelsey**  
  - **Luca**  
- Further investigation is required to determine which one of them is the thief.

#### To identify the name list that make a call less than a minute after leaving bakery based on Raymond description

In [16]:
%%sql
SELECT DISTINCT people.name, people.phone_number, phone_calls.caller, phone_calls.receiver
FROM phone_calls
JOIN people ON phone_calls.caller = people.phone_number
    WHERE month = 7
    AND day = 28
    AND duration < 60;

 * sqlite:///fiftyville.db
Done.

[('Sofia', '(130) 555-0289', '(130) 555-0289', '(996) 555-8899'),
 ('Kelsey', '(499) 555-9472', '(499) 555-9472', '(892) 555-8872'),
 ('Bruce', '(367) 555-5533', '(367) 555-5533', '(375) 555-8161'),
 ('Kelsey', '(499) 555-9472', '(499) 555-9472', '(717) 555-1342'),
 ('Taylor', '(286) 555-6063', '(286) 555-6063', '(676) 555-6554'),
 ('Diana', '(770) 555-1861', '(770) 555-1861', '(725) 555-3243'),
 ('Carina', '(031) 555-6622', '(031) 555-6622', '(910) 555-3251'),
 ('Kenny', '(826) 555-1652', '(826) 555-1652', '(066) 555-9701'),
 ('Benista', '(338) 555-6650', '(338) 555-6650', '(704) 555-2131')]

#### To narrow down the suspect list based on passport_number, license_plate and phone_number

In [17]:
%%sql
SELECT p1.name, p1.passport_number, p2.license_plate, p3.phone_number, p3.caller, p3.receiver
FROM 
    (SELECT people.name, people.passport_number 
     FROM people 
     JOIN passengers ON people.passport_number = passengers.passport_number
         WHERE passengers.flight_id = 36) AS p1
JOIN 
    (SELECT people.name, bakery_security_logs.license_plate 
     FROM people 
     JOIN bakery_security_logs ON people.license_plate = bakery_security_logs.license_plate
         WHERE bakery_security_logs.month = 7
        AND bakery_security_logs.day = 28
        AND bakery_security_logs.hour = 10
        AND bakery_security_logs.minute BETWEEN 15 AND 25
        AND bakery_security_logs.activity = 'exit') AS p2
ON p1.name = p2.name
JOIN
    (SELECT DISTINCT people.name, people.phone_number, phone_calls.caller, phone_calls.receiver
    FROM phone_calls
    JOIN people ON phone_calls.caller = people.phone_number
        WHERE month = 7
        AND day = 28
        AND duration < 60 ) AS p3
ON p1.name = p3.name;

 * sqlite:///fiftyville.db
Done.

[('Sofia', 1695452385, 'G412CB7', '(130) 555-0289', '(130) 555-0289', '(996) 555-8899'),
 ('Bruce', 5773159633, '94KL13X', '(367) 555-5533', '(367) 555-5533', '(375) 555-8161'),
 ('Kelsey', 8294398571, '0NTHK55', '(499) 555-9472', '(499) 555-9472', '(717) 555-1342'),
 ('Kelsey', 8294398571, '0NTHK55', '(499) 555-9472', '(499) 555-9472', '(892) 555-8872')]

### Suspect List Update

- After further investigation, the suspect list has been narrowed down to **three people**:  
  - **Sofia**  
  - **Bruce**  
  - **Kelsey**  
- The investigation now focuses on these three individuals to determine which one is the thief.

#### To narrow down the suspect list based on atm_transactions based on Eugenen description to get to know the list of the name and account_number
#### To combine the atm_transactions, bank_accounts and people table.

In [18]:
%%sql
SELECT people.name, bank_accounts.account_number
FROM people
JOIN bank_accounts ON people.id = bank_accounts.person_id
JOIN atm_transactions ON bank_accounts.account_number = atm_transactions.account_number
WHERE atm_transactions.month = 7
    AND atm_transactions.day = 28
    AND atm_transactions.atm_location LIKE '%Leggett%'
    AND atm_transactions.transaction_type = 'withdraw';

 * sqlite:///fiftyville.db
Done.

[('Bruce', 49610011),
 ('Diana', 26013199),
 ('Brooke', 16153065),
 ('Kenny', 28296815),
 ('Iman', 25506511),
 ('Luca', 28500762),
 ('Taylor', 76054385),
 ('Benista', 81061156)]

#### To narrow down the suspect list based on passport_number, license_plate, phone_number and account_number

In [19]:
%%sql
SELECT p1.name, p1.passport_number, p2.license_plate, p3.phone_number, p3.caller, p3.receiver, p4.account_number
FROM 
    (SELECT people.name, people.passport_number 
     FROM people 
     JOIN passengers ON people.passport_number = passengers.passport_number
         WHERE passengers.flight_id = 36) AS p1
JOIN 
    (SELECT people.name, bakery_security_logs.license_plate 
     FROM people 
     JOIN bakery_security_logs ON people.license_plate = bakery_security_logs.license_plate
         WHERE bakery_security_logs.month = 7
        AND bakery_security_logs.day = 28
        AND bakery_security_logs.hour = 10
        AND bakery_security_logs.minute BETWEEN 15 AND 25
        AND bakery_security_logs.activity = 'exit') AS p2
ON p1.name = p2.name
JOIN
    (SELECT DISTINCT people.name, people.phone_number, phone_calls.caller, phone_calls.receiver
    FROM phone_calls
    JOIN people ON phone_calls.caller = people.phone_number
        WHERE month = 7
        AND day = 28
        AND duration < 60 ) AS p3
ON p1.name = p3.name
JOIN
    (SELECT people.name, bank_accounts.account_number
    FROM people
    JOIN bank_accounts ON people.id = bank_accounts.person_id
    JOIN atm_transactions ON bank_accounts.account_number = atm_transactions.account_number
    WHERE atm_transactions.month = 7
        AND atm_transactions.day = 28
        AND atm_transactions.atm_location LIKE '%Leggett%'
        AND atm_transactions.transaction_type = 'withdraw') AS p4
ON p1.name = p4.name;

 * sqlite:///fiftyville.db
Done.

[('Bruce', 5773159633, '94KL13X', '(367) 555-5533', '(367) 555-5533', '(375) 555-8161', 49610011)]

### Question 1: Who is the thief?

- After analyzing all the clues and evidence, it has been determined that **Bruce** is the thief.

#### To show the answer for Question 1

In [20]:
%%sql
SELECT CONCAT('The thief is ', p1.name) AS 'Question 1'

FROM 
    (SELECT people.name, people.passport_number 
     FROM people 
     JOIN passengers ON people.passport_number = passengers.passport_number
         WHERE passengers.flight_id = 36) AS p1
JOIN 
    (SELECT people.name, bakery_security_logs.license_plate 
     FROM people 
     JOIN bakery_security_logs ON people.license_plate = bakery_security_logs.license_plate
        WHERE bakery_security_logs.month = 7
        AND bakery_security_logs.day = 28
        AND bakery_security_logs.hour = 10
        AND bakery_security_logs.minute BETWEEN 15 AND 25
        AND bakery_security_logs.activity = 'exit') AS p2
ON p1.name = p2.name
JOIN
    (SELECT DISTINCT people.name, people.phone_number, phone_calls.caller
    FROM phone_calls
    JOIN people ON phone_calls.caller = people.phone_number
        WHERE month = 7
        AND day = 28
        AND duration < 60 ) AS p3
ON p1.name = p3.name
JOIN
    (SELECT people.name, bank_accounts.account_number
    FROM people
    JOIN bank_accounts ON people.id = bank_accounts.person_id
    JOIN atm_transactions ON bank_accounts.account_number = atm_transactions.account_number
    WHERE atm_transactions.month = 7
        AND atm_transactions.day = 28
        AND atm_transactions.atm_location LIKE '%Leggett%'
        AND atm_transactions.transaction_type = 'withdraw') AS p4
ON p1.name = p4.name;

 * sqlite:///fiftyville.db
Done.

[('The thief is Bruce',)]

#### To show the answer for Question 2

In [21]:
%%sql
SELECT CONCAT('The city the thief escaped to is ', city) AS 'Question 2'
FROM airports
WHERE id = 4;

 * sqlite:///fiftyville.db
Done.

[('The city the thief escaped to is New York City',)]

#### For Q3: Who the thief’s accomplice is who helped them escape
#### From phone_calls list, the receiver number that Bruce called is (375) 555-8161
#### To show the answer for Question 3

In [22]:
%%sql
SELECT DISTINCT CONCAT('The accomplice who helped the thief escape is ', name) AS 'Question 3'
FROM people
JOIN phone_calls ON phone_calls.receiver = people.phone_number
WHERE receiver = '(375) 555-8161';

 * sqlite:///fiftyville.db
Done.

[('The accomplice who helped the thief escape is Robin',)]